In [1]:
import pandas as pd
import numpy as np

In [2]:
# üì• Baca Dataset
df = pd.read_csv('dataset_penjualan_kotor_1.csv')
df.head()

  Tanggal Transaksi Nama Produk   Kategori  Jumlah  Harga Satuan
0        21-03-2024        kaos    Pakaian     2.0      100000.0
1        2024/01/21      SEPATU  Alas Kaki     NaN       50000.0
2        26-01-2024      Celana    Pakaian     NaN           NaN
3       Feb 22 2024         Tas   Aksesori     NaN       50000.0
4        2024/01/03      SEPATU  Alas Kaki     0.0       50000.0

In [3]:
# üîç Cek Nilai Kosong dan Informasi Awal
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160 entries, 0 to 159
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Tanggal Transaksi  160 non-null    object
 1   Nama Produk        160 non-null    object
 2   Kategori           160 non-null    object
 3   Jumlah             121 non-null    float64
 4   Harga Satuan       120 non-null    float64
dtypes: float64(2), object(3)
memory usage: 6.4+ KB

Tanggal Transaksi     0
Nama Produk           0
Kategori              0
Jumlah               39
Harga Satuan         40
dtype: int64

In [5]:
# üî† Cek Nilai Unik
df['Nama Produk'].unique()
df['Tanggal Transaksi'].unique()[:10]

array(['21-03-2024', '2024/01/21', '26-01-2024', 'Feb 22 2024',
       '2024/01/03', '2024/03/23', '2024/02/09', '2024/03/13',
       'Mar 27 2024', '2024/02/08'], dtype=object)

In [6]:
## üßπ Data Cleaning 
# Coba parsing tanggal ke format YYYY-MM-DD
df['Tanggal Transaksi'] = pd.to_datetime(df['Tanggal Transaksi'], errors='coerce')

# Cek apakah ada yang gagal di-convert (hasilnya jadi NaT)
df['Tanggal Transaksi'].isnull().sum()

C:\Users\user\AppData\Local\Temp\ipykernel_5872\2932356753.py:3: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df['Tanggal Transaksi'] = pd.to_datetime(df['Tanggal Transaksi'], errors='coerce')

0

In [7]:
# Ubah semua ke huruf kecil
df['Nama Produk'] = df['Nama Produk'].str.lower()

# Lihat nilai unik setelah diseragamkan
df['Nama Produk'].unique()

array(['kaos', 'sepatu', 'celana', 'tas', 'kemeja', 'topi'], dtype=object)

In [8]:
# Hapus baris yang identik
df = df.drop_duplicates()

# Cek ukuran data sekarang
df.shape

(149, 5)

In [11]:
# Ganti NaN di Jumlah dan Harga Satuan dengan 0
df['Jumlah'] = pd.to_numeric(df['Jumlah'], errors='coerce').fillna(0).astype(int)
df['Harga Satuan'] = pd.to_numeric(df['Harga Satuan'], errors='coerce').fillna(0).astype(int)

In [12]:
# Simpan ke file CSV baru
df.to_csv("dataset_penjualan_bersih.csv", index=False)

In [13]:
print(df)

    Tanggal Transaksi Nama Produk   Kategori  Jumlah  Harga Satuan
0          2024-03-21        kaos    Pakaian       2        100000
1          2024-01-21      sepatu  Alas Kaki       0         50000
2          2024-01-26      celana    Pakaian       0             0
3          2024-02-22         tas   Aksesori       0         50000
4          2024-01-03      sepatu  Alas Kaki       0         50000
..                ...         ...        ...     ...           ...
145        2024-01-03      sepatu  Alas Kaki       5        150000
146        2024-01-13      celana    Pakaian       5         50000
147        2024-03-29      sepatu  Alas Kaki       0        150000
148        2024-02-05      kemeja    Pakaian       2         50000
149        2024-01-16      sepatu  Alas Kaki       3        100000

[149 rows x 5 columns]